# İleri Birleştirme İşlemleri

In [1]:
import pandas as pd

In [2]:
#birebir birleştirme

In [4]:
df1 = pd.DataFrame({"calisanlar": ["ali", "veli", "ayse", "fatma"],
                    "grup" : ["Muhasebe", "Muhendislik","Muhendislik", "IK"]})

In [5]:
df1

  calisanlar         grup
0        ali     Muhasebe
1       veli  Muhendislik
2       ayse  Muhendislik
3      fatma           IK

In [6]:
df2 = pd.DataFrame({"calisanlar":["ayse", "ali", "veli", "fatma"],
                    "ilk_giris": [2010, 2009, 2014, 2019]})

In [7]:
df2

  calisanlar  ilk_giris
0       ayse       2010
1        ali       2009
2       veli       2014
3      fatma       2019

In [8]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        ali     Muhasebe       2009
1       veli  Muhendislik       2014
2       ayse  Muhendislik       2010
3      fatma           IK       2019

In [9]:
pd.merge(df1, df2, on="calisanlar")

  calisanlar         grup  ilk_giris
0        ali     Muhasebe       2009
1       veli  Muhendislik       2014
2       ayse  Muhendislik       2010
3      fatma           IK       2019

In [11]:
#çoktan teke

In [12]:
df3 = pd.merge(df1, df2)

In [13]:
df3

  calisanlar         grup  ilk_giris
0        ali     Muhasebe       2009
1       veli  Muhendislik       2014
2       ayse  Muhendislik       2010
3      fatma           IK       2019

In [14]:
df4 = pd.DataFrame({"grup":["Muhasebe", "Muhendislik", "IK"],
                    "mudur": ["Caner", "Mustafa", "Berkcan"] })

In [15]:
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [16]:
pd.merge(df3, df4)

  calisanlar         grup  ilk_giris    mudur
0        ali     Muhasebe       2009    Caner
1       veli  Muhendislik       2014  Mustafa
2       ayse  Muhendislik       2010  Mustafa
3      fatma           IK       2019  Berkcan

In [17]:
# çoktan çoğa

In [18]:
df5 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe", "Muhendislik", "Muhendislik", "IK", "IK"],
                    "yetenekler": ["matematik", "excel", "kodlama", "linux", "excel", "yonetim"]})

In [19]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [20]:
df1

  calisanlar         grup
0        ali     Muhasebe
1       veli  Muhendislik
2       ayse  Muhendislik
3      fatma           IK

In [21]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        ali     Muhasebe  matematik
1        ali     Muhasebe      excel
2       veli  Muhendislik    kodlama
3       veli  Muhendislik      linux
4       ayse  Muhendislik    kodlama
5       ayse  Muhendislik      linux
6      fatma           IK      excel
7      fatma           IK    yonetim